tap "charmbracelet/tap"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
brew "act"
brew "ansible"
brew "atuin"
brew "bat"
brew "bazel"
brew "binwalk"
brew "bun"
brew "charmbracelet/tap/crush"
brew "cocoapods"
brew "comby"
brew "diff-so-fancy"
brew "direnv"
brew "doctl"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gradle"
brew "helix"
brew "helm"
brew "heroku"
brew "hey"
brew "jj"
brew "jprq"
brew "jq"
brew "libpq"
brew "mise"
brew "mole"
brew "mvfst"
brew "nicotine-plus"
brew "openjdk@17"
brew "pnpm"
brew "poppler"
brew "postgresql@16", restart_service: true
brew "prettyping"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "terraform"
brew "watchman"
cask "1password"
cask "1password-cli"
cask "ableton-live-suite"
cask "android-studio"
cask "arc"
cask "cleanmymac"
cask "cleanshot"
cask "cursor"
cask "discord"
cask "figma"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "iina"
cask "logi-options+"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "postico"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "zoom"
