tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "sourcegraph/src-cli"
brew "act"
brew "bat"
brew "bazelisk"
brew "boost"
brew "cocoapods"
brew "diff-so-fancy"
brew "doctl"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "ffmpeg"
brew "fzf"
brew "go"
brew "jq"
brew "libpq"
brew "nvm"
brew "pnpm"
brew "postgresql@15", restart_service: true
brew "python@3.11"
brew "redis", restart_service: true
brew "shellcheck"
brew "watchman"
brew "sourcegraph/src-cli/src-cli"
cask "font-sf-mono-nerd-font"
cask "ngrok"
cask "zulu11"
vscode "antfu.icons-carbon"
vscode "bradlc.vscode-tailwindcss"
vscode "EditorConfig.EditorConfig"
vscode "EliverLara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hkh12.pitch-black"
vscode "mechatroner.rainbow-csv"
vscode "moalamri.inline-fold"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "sourcegraph.cody-ai"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "whizkydee.material-palenight-theme"
vscode "YoavBls.pretty-ts-errors"
vscode "Yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
