tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"
brew "act"
brew "bat"
brew "bazelisk"
brew "boost"
brew "cocoapods"
brew "diff-so-fancy"
brew "docker"
brew "doctl"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "go"
brew "hey"
brew "jq"
brew "libpq"
brew "mise"
brew "openjdk@17"
brew "pnpm"
brew "postgresql@15", restart_service: true
brew "prettyping"
brew "python@3.11"
brew "redis", restart_service: true
brew "shellcheck"
brew "watchman"
cask "1password"
cask "1password-cli"
cask "ableton-live-suite"
cask "android-studio"
cask "arc"
cask "cleanmymac"
cask "cleanshot"
cask "cursor"
cask "discord"
cask "figma"
cask "font-sf-mono-nerd-font"
cask "kitty"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "postico"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zulu11"
vscode "74th.monokai-charcoal-high-contrast"
vscode "akamud.vscode-theme-onedark"
vscode "antfu.icons-carbon"
vscode "artlaman.chalice-icon-theme"
vscode "bradlc.vscode-tailwindcss"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hkh12.pitch-black"
vscode "hmseeb.seeb"
vscode "mechatroner.rainbow-csv"
vscode "moalamri.inline-fold"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "sourcegraph.cody-ai"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "whizkydee.material-palenight-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
