tap "ampcode/tap"
tap "modem-dev/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Load/unload environment variables based on $PWD
brew "direnv"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Manage stacked Git branches
brew "git-spice"
# Live reload for Go apps
brew "go-air"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Drop-in replacement for Terraform (open-source fork)
brew "opentofu"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@17", restart_service: :changed, link: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Generate type safe Go from SQL
brew "sqlc"
# CLI for Amp, the frontier coding agent
brew "ampcode/tap/ampcode", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# Image editing and design software
cask "affinity"
# Tools for building Android applications
cask "android-studio"
# Records audio from any application
cask "audio-hijack"
# File manager
cask "bloom"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Collaborative team software
cask "figma"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Cable-free audio router
cask "loopback"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# All system and utility switches in one place
cask "one-switch"
# Replacement for Docker Desktop
cask "orbstack"
# HTTP debugging proxy
cask "proxyman"
# Team communication and collaboration software
cask "slack"
# Browse and preview sounds from Splice’s entire catalog
cask "splice"
# Music streaming service
cask "spotify"
# Open-source media center
cask "stremio"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Native GUI tool for relational databases
cask "tableplus"
# Unpacks archive files
cask "the-unarchiver"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
go "golang.org/x/tools/cmd/goimports"
npm "corepack"
