# Shared packages installed on every machine, regardless of profile.
# Profile-specific extras live in Brewfile.personal / Brewfile.work; setup.sh
# applies this file first, then the one matching ~/.config/dotfiles/profile.
tap "ampcode/tap"
tap "modem-dev/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Local proxy for connecting to Cloud SQL instances
brew "cloud-sql-proxy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Manage stacked Git branches
brew "git-spice"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Object-relational database system
brew "postgresql@17", restart_service: :changed, link: true
# Fast, disk space efficient package manager
brew "pnpm"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Generate type safe Go from SQL
brew "sqlc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# CLI for Amp, the frontier coding agent
brew "ampcode/tap/ampcode", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Collaborative team software
cask "figma"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Unpacks archive files
cask "the-unarchiver"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
go "golang.org/x/tools/cmd/goimports"
npm "corepack"
